{"format": "graph-model", "generatedBy": "2.11.0", "convertedBy": "TensorFlow.js Converter v4.1.0", "signature": {"inputs": {"args_1:0": {"name": "args_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}]}}, "args_0:0": {"name": "args_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/model_2/PartitionedCall/l2_normalize/Sum/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/model_2/PartitionedCall/l2_normalize/Maximum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/PartitionedCall/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/PartitionedCall/l2_normalize_1/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/PartitionedCall/l2_normalize_1/Maximum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/PartitionedCall/ExpandDims_1/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/model_2/PartitionedCall/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "args_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}]}}}}, {"name": "PartitionedCall/model_2/PartitionedCall/l2_normalize/Square", "op": "Square", "input": ["args_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/PartitionedCall/l2_normalize_1/Square", "op": "Square", "input": ["args_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/PartitionedCall/l2_normalize/Sum", "op": "Sum", "input": ["PartitionedCall/model_2/PartitionedCall/l2_normalize/Square", "PartitionedCall/model_2/PartitionedCall/l2_normalize/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/PartitionedCall/l2_normalize_1/Sum", "op": "Sum", "input": ["PartitionedCall/model_2/PartitionedCall/l2_normalize_1/Square", "PartitionedCall/model_2/PartitionedCall/l2_normalize_1/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/PartitionedCall/l2_normalize/Maximum", "op": "Maximum", "input": ["PartitionedCall/model_2/PartitionedCall/l2_normalize/Sum", "PartitionedCall/model_2/PartitionedCall/l2_normalize/Maximum/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/PartitionedCall/l2_normalize_1/Maximum", "op": "Maximum", "input": ["PartitionedCall/model_2/PartitionedCall/l2_normalize_1/Sum", "PartitionedCall/model_2/PartitionedCall/l2_normalize_1/Maximum/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/PartitionedCall/l2_normalize/Rsqrt", "op": "Rsqrt", "input": ["PartitionedCall/model_2/PartitionedCall/l2_normalize/Maximum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/PartitionedCall/l2_normalize_1/Rsqrt", "op": "Rsqrt", "input": ["PartitionedCall/model_2/PartitionedCall/l2_normalize_1/Maximum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/PartitionedCall/l2_normalize", "op": "Mul", "input": ["args_0", "PartitionedCall/model_2/PartitionedCall/l2_normalize/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/PartitionedCall/l2_normalize_1", "op": "Mul", "input": ["args_1", "PartitionedCall/model_2/PartitionedCall/l2_normalize_1/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/PartitionedCall/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_2/PartitionedCall/l2_normalize", "PartitionedCall/model_2/PartitionedCall/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/PartitionedCall/ExpandDims_1", "op": "ExpandDims", "input": ["PartitionedCall/model_2/PartitionedCall/l2_normalize_1", "PartitionedCall/model_2/PartitionedCall/ExpandDims_1/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/PartitionedCall/mul", "op": "Mul", "input": ["PartitionedCall/model_2/PartitionedCall/ExpandDims", "PartitionedCall/model_2/PartitionedCall/ExpandDims_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/PartitionedCall/Sum", "op": "Sum", "input": ["PartitionedCall/model_2/PartitionedCall/mul", "PartitionedCall/model_2/PartitionedCall/Sum/reduction_indices"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/model_2/PartitionedCall/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1286}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "PartitionedCall/model_2/PartitionedCall/l2_normalize/Sum/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_2/PartitionedCall/l2_normalize/Maximum/y", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/model_2/PartitionedCall/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_2/PartitionedCall/l2_normalize_1/Sum/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_2/PartitionedCall/l2_normalize_1/Maximum/y", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/model_2/PartitionedCall/ExpandDims_1/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_2/PartitionedCall/Sum/reduction_indices", "shape": [], "dtype": "int32"}]}]}